MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F425VG/mcu.h
    __IM  uint32_t  RESERVED4[5];

    /** TX Good Frames Counter Register */
    union
    {
        __IM uint32_t TXGFCNT;

        struct
        {
            __IM  uint32_t TXGFCNT       : 32;
        } TXGFCNT_B;
    } ;

    __IM  uint32_t  RESERVED5[10];

    /** RX Frames With CRC Error Counter Register */
    union
    {
        __IM uint32_t RXFCECNT;

        struct
        {
            __IM  uint32_t RXFCECNT       : 32;
        } RXFCECNT_B;
    } ;

    /** RX Frames With Alignment Error Counter Register */
    union
    {
        __IM uint32_t RXFAECNT;

        struct
        {
            __IM  uint32_t RXFAECNT       : 32;
        } RXFAECNT_B;
    } ;

    __IM  uint32_t  RESERVED6[10];

    /** RX Good Unicast Frames Counter Register */
    union
    {
        __IM uint32_t RXGUNCNT;

        struct
        {
            __IM  uint32_t RXGUNCNT       : 32;
        } RXGUNCNT_B;
    } ;

    __IM  uint32_t  RESERVED7[334];

    /**
      * @brief Ethernet: Precision time protocol (Ethernet_PTP)
      */
    union
    {
        __IOM uint32_t TSCTRL;                      /*!< (@ 0x00000000) Ethernet PTP time stamp control register                   */

        struct
        {
            __IOM uint32_t TSEN       : 1;            /*!< [0..0] Time Stamp Enable                                                  */
            __IOM uint32_t TSUDSEL    : 1;            /*!< [1..1] Time Stamp Update Mode Select                                      */
            __IOM uint32_t TSSTINIT   : 1;            /*!< [2..2] Time Stamp System Time Initialize                                  */
            __IOM uint32_t TSSTUD     : 1;            /*!< [3..3] Time Stamp System Time Update                                      */
            __IOM uint32_t TSTRGIEN   : 1;            /*!< [4..4] Time Stamp Trigger Interrupt Enable                                */
            __IOM uint32_t TSADDUD    : 1;            /*!< [5..5] Time Stamp Addend Register Update                                  */
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t TSSNEN     : 1;            /*!< [8..8] Time Stamp Snapshot for Received Frames Enable                     */
            __IOM uint32_t TSSUBRO    : 1;            /*!< [9..9] Time Stamp Subsecond Rollover                                      */
            __IOM uint32_t LISTVSEL   : 1;            /*!< [10..10] Listening Version Select                                         */
            __IOM uint32_t TSSPTPEN   : 1;            /*!< [11..11] Time Stamp Snapshot for PTP Ethernet Frames Enable               */
            __IOM uint32_t TSS6EN     : 1;            /*!< [12..12] Time stamp snapshot for IPv6 frames Enable                       */
            __IOM uint32_t TSS4EN     : 1;            /*!< [13..13] Time Stamp Snapshot for IPv4 Frames Enable                       */
            __IOM uint32_t TSSMESEL   : 1;            /*!< [14..14] Time Stamp Snapshot for Message Select                           */
            __IOM uint32_t TSSMNSEL   : 1;            /*!< [15..15] Time Stamp Snapshot for Master Node Select                       */
            __IOM uint32_t TSCLKNSEL  : 2;            /*!< [17..16] Time stamp Clock Node Select                                     */
            __IOM uint32_t TSSPTPFMACEN : 1;          /*!< [18..18] Time Stamp PTP Frame Filtering MAC Address Enable                */
            __IM  uint32_t RESERVED12  : 13;
        } TSCTRL_B;
    } ;

    union
    {
        __IOM uint32_t SUBSECI;                     /*!< (@ 0x00000004) Ethernet PTP subsecond increment register                  */

        struct
        {
            __IOM uint32_t STSUBSECI  : 8;            /*!< [7..0] System Time Subseconds Incremen                                    */
            __IM  uint32_t RESERVED   : 24;
        } SUBSECI_B;
    } ;

    union
    {
        __IM  uint32_t TSH;                         /*!< (@ 0x00000008) Ethernet PTP time stamp high register                      */

        struct
        {
            __IM  uint32_t STSEC      : 32;           /*!< [31..0] System Time Second Value                                          */
        } TSH_B;
    } ;

    union
    {
        __IM  uint32_t TSL;                         /*!< (@ 0x0000000C) Ethernet PTP time stamp low register                       */

        struct
        {
            __IM  uint32_t STSUBSEC   : 31;           /*!< [30..0] System Time Subseconds Value                                      */
            __IM  uint32_t STSEL      : 1;            /*!< [31..31] System Time Select                                               */
        } TSL_B;
    } ;

    union
    {
        __IOM uint32_t TSHUD;                       /*!< (@ 0x00000010) Ethernet PTP time stamp high update register               */

        struct
        {
            __IOM uint32_t TSUDSEC    : 32;           /*!< [31..0] Time Stamp Update Second Value                                    */
        } TSHUD_B;
    } ;

    union
    {
        __IOM uint32_t TSLUD;                       /*!< (@ 0x00000014) Ethernet PTP time stamp low update register                */

        struct
        {
            __IOM uint32_t TSUDSUBSEC : 31;           /*!< [30..0] Time Stamp Update Subseconds Value                                */
            __IOM uint32_t TSUDSEL    : 1;            /*!< [31..31] Time Stamp Update Select                                         */
        } TSLUD_B;
    } ;

    union
    {
        __IOM uint32_t TSA;                         /*!< (@ 0x00000018) Ethernet PTP time stamp addend register                    */

        struct
        {
            __IOM uint32_t TSA        : 32;           /*!< [31..0] Time Stamp Addend Value                                           */
        } TSA_B;
    } ;

    union
    {
        __IOM uint32_t TTSH;                        /*!< (@ 0x0000001C) Ethernet PTP target time high register                     */

        struct
        {
            __IOM uint32_t TTSH       : 32;           /*!< [31..0] Target Time Stamp High Value                                      */
        } TTSH_B;
    } ;

    union
    {
        __IOM uint32_t TTSL;                        /*!< (@ 0x00000020) Ethernet PTP target time low register                      */

        struct
        {
            __IOM uint32_t TTSL       : 32;           /*!< [31..0] Target Time Stamp Low Value                                       */
        } TTSL_B;
    } ;
    __IM  uint32_t  RESERVED8;

    union
    {
        __IM  uint32_t TSSTS;                       /*!< (@ 0x00000028) Ethernet PTP time stamp status register                    */

        struct
        {
            __IM  uint32_t TSSECOVR   : 1;            /*!< [0..0] Time Stamp Second Value Overflow                                   */
            __IM  uint32_t TTSRD      : 1;            /*!< [1..1] Target Time Stamp Value Reached                                    */
            __IM  uint32_t RESERVED   : 30;
        } TSSTS_B;
    } ;

    union
    {
        __IM  uint32_t PPSCTRL;                     /*!< (@ 0x0000002C) Ethernet PTP PPS control register                          */

        struct
        {
            __IM  uint32_t PPSFSEL    : 4;            /*!< [3..0] PPS Frequency Selection                                            */
            __IM  uint32_t RESERVED   : 28;
        } PPSCTRL_B;
    } ;

    __IM  uint32_t  RESERVED9[564];

    /**
      * @brief Ethernet: DMA controller operation (Ethernet_DMA)
      */
    union
    {
        __IOM uint32_t DMABMOD;                     /*!< (@ 0x00000000) Ethernet DMA bus mode register                             */

        struct
        {
            __IOM uint32_t SWR        : 1;            /*!< [0..0] Software Reset                                                     */
            __IOM uint32_t DAS        : 1;            /*!< [1..1] DMA Arbitration Scheme                                             */
            __IOM uint32_t DSL        : 5;            /*!< [6..2] Descriptor Skip Length                                             */
            __IOM uint32_t EDFEN      : 1;            /*!< [7..7] Enhanced Descriptor Format Enable                                  */
            __IOM uint32_t PBL        : 6;            /*!< [13..8] Programmable Burst Length                                         */
            __IOM uint32_t PR         : 2;            /*!< [15..14] Priority Ratio                                                   */
            __IOM uint32_t FB         : 1;            /*!< [16..16] Fixed Burst                                                      */
            __IOM uint32_t RPBL       : 6;            /*!< [22..17] Rx DMA PBL                                                       */
            __IOM uint32_t USP        : 1;            /*!< [23..23] Use Separate PBL                                                 */
            __IOM uint32_t PBLx4      : 1;            /*!< [24..24] PBLx4 Mode                                                       */
            __IOM uint32_t AAL        : 1;            /*!< [25..25] Address-Aligned Beats                                            */
            __IOM uint32_t MB         : 1;            /*!< [26..26] Mixed Burst                                                      */
            __IM  uint32_t RESERVED   : 5;
        } DMABMOD_B;
    } ;

    union
    {
        __IOM uint32_t DMATXPD;                     /*!< (@ 0x00000004) Ethernet DMA transmit poll demand register                 */

        struct
        {
            __IOM uint32_t TXPD       : 32;           /*!< [31..0] Transmit Poll Demand                                              */
        } DMATXPD_B;
    } ;

    union
    {
        __IOM uint32_t DMARXPD;                     /*!< (@ 0x00000008) EHERNET DMA receive poll demand register                   */

        struct
        {
            __IOM uint32_t RXPD       : 32;           /*!< [31..0] Receive Poll Demand                                               */
        } DMARXPD_B;
    } ;

    union
    {
        __IOM uint32_t DMARXDLADDR;                 /*!< (@ 0x0000000C) Ethernet DMA receive descriptor list address
                                                                    register                                                   */

        struct
        {
            __IOM uint32_t RXSTA      : 32;           /*!< [31..0] Start of Receive List                                             */
        } DMARXDLADDR_B;
    } ;

    union
    {
        __IOM uint32_t DMATXDLADDR;                 /*!< (@ 0x00000010) Ethernet DMA transmit descriptor list address
                                                                    register                                                   */

        struct
        {
            __IOM uint32_t TXSTA      : 32;           /*!< [31..0] Start of Transmit List                                            */
        } DMATXDLADDR_B;
    } ;

    union
    {
        __IOM uint32_t DMASTS;                      /*!< (@ 0x00000014) Ethernet DMA status register                               */

        struct
        {
            __IOM uint32_t TXFLG      : 1;            /*!< [0..0] Transmit Flag                                                      */
            __IOM uint32_t TXSFLG     : 1;            /*!< [1..1] Transmit Stopped Flag                                              */
            __IOM uint32_t TXBU       : 1;            /*!< [2..2] Transmit Buffer Unavailable                                        */
            __IOM uint32_t TXJTO      : 1;            /*!< [3..3] Transmit Jabber Timeout                                            */
            __IOM uint32_t RXOVF      : 1;            /*!< [4..4] Receive Overflow                                                   */
            __IOM uint32_t TXUNF      : 1;            /*!< [5..5] Transmit Underflow                                                 */
            __IOM uint32_t RXFLG      : 1;            /*!< [6..6] Receive Flag                                                       */
            __IOM uint32_t RXBU       : 1;            /*!< [7..7] Receive Buffer Unavailable                                         */
            __IOM uint32_t RXSFLG     : 1;            /*!< [8..8] Receive Stopped Flag                                               */
            __IOM uint32_t RXWTOFLG   : 1;            /*!< [9..9] Receive Watchdog Timeout Flag                                      */
            __IOM uint32_t ETXFLG     : 1;            /*!< [10..10] Early Transmit Flag                                              */
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t FBERRFLG   : 1;            /*!< [13..13] Fatal Bus Error Flag                                             */
            __IOM uint32_t ERXFLG     : 1;            /*!< [14..14] Early Receive Flag                                               */
            __IOM uint32_t AINTS      : 1;            /*!< [15..15] Abnormal Interrupt Summary                                       */
            __IOM uint32_t NINTS      : 1;            /*!< [16..16] Normal Interrupt Summary                                         */
            __IM  uint32_t RXSTS      : 3;            /*!< [19..17] Receive Process State                                            */
            __IM  uint32_t TXSTS      : 3;            /*!< [22..20] Transmit Process State                                           */
            __IM  uint32_t ERRB       : 3;            /*!< [25..23] Error Bits                                                       */
            __IM  uint32_t RESERVED2  : 1;
            __IM  uint32_t MMCFLG     : 1;            /*!< [27..27] MMC Flag                                                         */
            __IM  uint32_t PMTFLG     : 1;            /*!< [28..28] PMT Flag                                                         */
            __IM  uint32_t TSTFLG     : 1;            /*!< [29..29] Timestamp Trigger Flag                                           */
            __IM  uint32_t RESERVED3  : 2;
        } DMASTS_B;
    } ;

    union
    {
        __IOM uint32_t DMAOPMOD;                    /*!< (@ 0x00000018) Ethernet DMA operation mode register                       */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t STRX       : 1;            /*!< [1..1] Start or Stop Receive                                              */
            __IOM uint32_t OSECF      : 1;            /*!< [2..2] Operate on Second Frame                                            */
            __IOM uint32_t RXTHCTRL   : 2;            /*!< [4..3] Receive Threshold Control                                          */
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t FUF        : 1;            /*!< [6..6] Forward Undersized Good Frames                                     */
            __IOM uint32_t FERRF      : 1;            /*!< [7..7] Forward Error Frames                                               */
            __IM  uint32_t RESERVED2  : 5;
            __IOM uint32_t STTX       : 1;            /*!< [13..13] Start or Stop Transmission Command                               */
            __IOM uint32_t TXTHCTRL   : 3;            /*!< [16..14] Transmit Threshold Control                                       */
            __IM  uint32_t RESERVED3  : 3;
            __IOM uint32_t FTXF       : 1;            /*!< [20..20] Flush Transmit FIFO                                              */
            __IOM uint32_t TXSF       : 1;            /*!< [21..21] Transmit Store and Forward                                       */
            __IM  uint32_t RESERVED4  : 2;
            __IOM uint32_t DISFRXF    : 1;            /*!< [24..24] Disable Flushing of Received Frames                              */
            __IOM uint32_t RXSF       : 1;            /*!< [25..25] Receive Store and Forward                                        */
            __IOM uint32_t DISDT      : 1;            /*!< [26..26] Disable Dropping of TCP/IP Checksum Error Frames                 */
            __IM  uint32_t RESERVED5  : 5;
        } DMAOPMOD_B;
    } ;

    union
    {
        __IOM uint32_t DMAINTEN;                    /*!< (@ 0x0000001C) Ethernet DMA interrupt enable register                     */

        struct
        {
            __IOM uint32_t TXIEN      : 1;            /*!< [0..0] Transmit Interrupt Enable                                          */
            __IOM uint32_t TXSEN      : 1;            /*!< [1..1] Transmit Stopped Enable                                            */
            __IOM uint32_t TXBUEN     : 1;            /*!< [2..2] Transmit Buffer Unavailable Enable                                 */
            __IOM uint32_t TXJTOEN    : 1;            /*!< [3..3] Transmit Jabber Timeout Enable                                     */
            __IOM uint32_t RXOVFEN    : 1;            /*!< [4..4] Receive Overflow Interrupt Enable                                  */
            __IOM uint32_t TXUNFEN    : 1;            /*!< [5..5] Transmit Underflow Interrupt Enable                                */
            __IOM uint32_t RXIEN      : 1;            /*!< [6..6] Receive Interrupt Enable                                           */
            __IOM uint32_t RXBUEN     : 1;            /*!< [7..7] Receive Buffer Unavailable Enable                                  */
            __IOM uint32_t RXSEN      : 1;            /*!< [8..8] Receive Stopped Enable                                             */
            __IOM uint32_t RXWTOEN    : 1;            /*!< [9..9] Receive Watchdog Timeout Enable                                    */
            __IOM uint32_t ETXIEN     : 1;            /*!< [10..10] Early Transmit Interrupt Enable                                  */
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t FBERREN    : 1;            /*!< [13..13] Fatal Bus Error Enable                                           */
            __IOM uint32_t ERXIEN     : 1;            /*!< [14..14] Early Receive Interrupt Enable                                   */
            __IOM uint32_t AINTSEN    : 1;            /*!< [15..15] Abnormal Interrupt Summary Enable                                */
            __IOM uint32_t NINTSEN    : 1;            /*!< [16..16] Normal Interrupt Summary Enable                                  */
            __IM  uint32_t RESERVED2  : 15;
        } DMAINTEN_B;
    } ;

    union
    {
        __IOM uint32_t DMAMFABOCNT;                 /*!< (@ 0x00000020) Ethernet DMA missed frame and buffer overflow
                                                                    counter register                                           */

        struct
        {
            __IOM uint32_t MISFCNT    : 16;           /*!< [15..0] Missed Frame Counter                                              */
            __IOM uint32_t MISFCNTOVF : 1;            /*!< [16..16] Overflow Bit for Missed Frame Counter                            */
            __IOM uint32_t AMISFCNT   : 11;           /*!< [27..17] Missed Frame Counter                                             */
            __IOM uint32_t OVFCNTOVF  : 1;            /*!< [28..28] Overflow Bit for FIFO Overflow Counter                           */
            __IM  uint32_t RESERVED   : 3;
        } DMAMFABOCNT_B;
    } ;

    union
    {
        __IOM uint32_t DMARXFLGWDT;                 /*!< (@ 0x00000024) Ethernet DMA receive status watchdog timer register        */

        struct
        {
            __IOM uint32_t RXWDTCNT   : 8;            /*!< [7..0] RXFLG Watchdog Timer Count                                         */
            __IM  uint32_t RESERVED   : 24;
        } DMARXFLGWDT_B;
    } ;
    __IM  uint32_t  RESERVED10[8];

    union
    {
        __IM  uint32_t DMAHTXD;                     /*!< (@ 0x00000048) Ethernet DMA current host transmit descriptor
                                                                    register                                                   */
        struct
        {
            __IM  uint32_t HTXDADDRP  : 32;           /*!< [31..0] Host Transmit Descriptor Address Pointer                          */
        } DMAHTXD_B;
    } ;

    union
    {
        __IM  uint32_t DMAHRXD;                     /*!< (@ 0x0000004C) Ethernet DMA current host receive descriptor
                                                                    register                                                   */
        struct
        {
            __IM  uint32_t HRXDADDRP  : 32;           /*!< [31..0] Host Receive Descriptor Address Pointer                           */
        } DMAHRXD_B;
    } ;

    union
    {
        __IM  uint32_t DMAHTXBADDR;                 /*!< (@ 0x00000050) Ethernet DMA current host transmit buffer address
                                                                    register                                                   */

        struct
        {
            __IM  uint32_t HTXBADDRP  : 32;           /*!< [31..0] Host Transmit Buffer Address Pointer                              */
        } DMAHTXBADDR_B;
    } ;

    union
    {
        __IM  uint32_t DMAHRXBADDR;                 /*!< (@ 0x00000054) Ethernet DMA current host receive buffer address
                                                                    register                                                   */

        struct
        {
            __IM  uint32_t HRXBADDRP  : 32;           /*!< [31..0] Host Receive Buffer Address Pointer                               */
        } DMAHRXBADDR_B;
    } ;
} ETH_T;

/**
 * @brief    Random Number Generator (RNG)
 */
typedef struct
{
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IM   uint32_t RESERVED       : 2;
            __IOM  uint32_t RNGEN          : 1;
            __IOM  uint32_t INTEN          : 1;
            __IM   uint32_t RESERVED1      : 28;
        } CTRL_B;
    };

    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM   uint32_t DATARDY        : 1;
            __IM   uint32_t CLKERCSTS      : 1;
            __IM   uint32_t FSCSTS         : 1;
            __IM   uint32_t RESERVED1      : 2;
            __IOM  uint32_t CLKERINT       : 1;
            __IOM  uint32_t FSINT          : 1;
            __IM   uint32_t RESERVED2      : 25;
        } STS_B;
    };

    union
    {
        __IM uint32_t DATA;

        struct
        {
            __IM   uint32_t DATA           : 32;
        } DATA_B;
    };
} RNG_T;

/**
 * @brief Queued serial peripheral interface(QSPI)
 */
typedef struct
{
    /* @brief Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t DFS             : 5;
            __IM  uint32_t RESERVED1       : 5;
            __IOM uint32_t TXMODE          : 2;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t SSTEN           : 1;
            __IM  uint32_t RESERVED3       : 7;
            __IOM uint32_t FRF             : 2;
            __IM  uint32_t RESERVED4       : 8;
        } CTRL1_B;
    };

    /* @brief Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t NDF             : 16;
            __IM  uint32_t RESERVED        : 16;
        } CTRL2_B;
    };

    /* @brief QSPI Enable register */
    union
    {
        __IOM uint32_t SSIEN;
        struct
        {
            __IOM uint32_t EN              : 1;
            __IM  uint32_t RESERVED        : 31;
        } SSIEN_B;
    };

